{
  "_name_or_path": "/content/electra-base/electra-base-is/pytorch_model.bin",
  "architectures": [
    "ElectraForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "embedding_size": 768,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "B-Date",
    "1": "B-Location",
    "2": "B-Miscellaneous",
    "3": "B-Money",
    "4": "B-Organization",
    "5": "B-Percent",
    "6": "B-Person",
    "7": "B-Time",
    "8": "I-Date",
    "9": "I-Location",
    "10": "I-Miscellaneous",
    "11": "I-Money",
    "12": "I-Organization",
    "13": "I-Percent",
    "14": "I-Person",
    "15": "I-Time",
    "16": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-Date": 0,
    "B-Location": 1,
    "B-Miscellaneous": 2,
    "B-Money": 3,
    "B-Organization": 4,
    "B-Percent": 5,
    "B-Person": 6,
    "B-Time": 7,
    "I-Date": 8,
    "I-Location": 9,
    "I-Miscellaneous": 10,
    "I-Money": 11,
    "I-Organization": 12,
    "I-Percent": 13,
    "I-Person": 14,
    "I-Time": 15,
    "O": 16
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "electra",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "summary_activation": "gelu",
  "summary_last_dropout": 0.1,
  "summary_type": "first",
  "summary_use_proj": true,
  "transformers_version": "4.5.0.dev0",
  "type_vocab_size": 2,
  "vocab_size": 32105
}
