{"do_lower_case": false, "do_basic_tokenize": true, "never_split": null, "unk_token": "[UNK]", "sep_token": "[SEP]", "pad_token": "[PAD]", "cls_token": "[CLS]", "mask_token": "[MASK]", "tokenize_chinese_chars": true, "strip_accents": false, "model_max_length": 512, "special_tokens_map_file": "/content/electra-base/electra-base-is/special_tokens_map.json", "tokenizer_file": null, "name_or_path": "/content/electra-base/electra-base-is"}